СМП_ОнлайнОбменДанными/cfe/src/Catalogs/ПравилаКонвертацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииОбъектов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СМП_УчетныеЗаписиОбменов</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Объекты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Объекты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередВыгрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриВыгрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗагрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриЗагрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапоминатьВыгруженные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьПоИдентификатору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыгружатьОбъектыСвойствПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПоследовательностьПолейПоиска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБыстрыйПоискПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьНовыйНомерИлиКодЕслиНеУказан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОбъектовОбмена</name>
    <type>
      <types>EnumRef.ПриоритетОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкаВариантовПоискаОбъектов</name>
    <attributes>
      <name>ИмяНастройкиДляАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/ПравилаКонвертацииОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииЧтенииНаСервере();
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Редактор кода
	#Если ВебКлиент Тогда
		
	#Иначе
		
		НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ЗагрузитьРедакторКода", ЭтотОбъект));
		ОбновитьНаличиеОбработчиковАлгоритмов();
		
	#КонецЕсли
	
	ОбновитьТекущийАктивныйОбработчик();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Редактор кода
	Объект.АлгоритмПередВыгрузкойОбъекта = Элементы.АлгоритмПередВыгрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриВыгрузкеОбъекта = Элементы.АлгоритмПриВыгрузкеОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеВыгрузкиОбъекта = Элементы.АлгоритмПослеВыгрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена = Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбменаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПоследовательностьПолейПоиска = Элементы.АлгоритмПоследовательностьПолейПоискаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПередЗагрузкойОбъекта = Элементы.АлгоритмПередЗагрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриЗагрузкеОбъекта = Элементы.АлгоритмПриЗагрузкеОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеЗагрузкиОбъекта = Элементы.АлгоритмПослеЗагрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.РедактированиеЭлементаВФорме = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьПравилаКонвертации");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	ИсточникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(КонфигурацияПриемник) Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Оповещение = Новый ОписаниеОповещения("ИсточникНачалоВыбораЗавершение", ЭтотОбъект);
	//	мПараметрыФормы = Новый Структура("ВидОбъектаОбмена", ПредопределенноеЗначение("Перечисление.СМП_ВидыОбъектовОбмена.ОбъектМетаданных"));
	//	ОткрытьФорму("ОбщаяФорма.СМП_ФормаВыбораПриемника", мПараметрыФормы, Элемент,,,, Оповещение);
	//КонецЕсли;
	//
КонецПроцедуры 

// Обработчик оповещения выбора приемника.
//
&НаКлиенте
Процедура ИсточникНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.Источник = РезультатЗакрытия.Имя;
		Если НЕ Модифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ИсточникНачалоВыбораЗавершение

&НаКлиенте
Процедура ПриемникПриИзменении(Элемент)
	
	ПриемникПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Если ЗначениеЗаполнено(КонфигурацияИсточник) Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Оповещение = Новый ОписаниеОповещения("ПриемникНачалоВыбораЗавершение", ЭтотОбъект);
	//	мПараметрыФормы = Новый Структура("ВидОбъектаОбмена", ПредопределенноеЗначение("Перечисление.СМП_ВидыОбъектовОбмена.ОбъектМетаданных"));
	//	ОткрытьФорму("ОбщаяФорма.СМП_ФормаВыбораПриемника", мПараметрыФормы, Элемент,,,, Оповещение);
	//КонецЕсли;
	//
КонецПроцедуры

// Обработчик оповещения выбора приемника.
//
&НаКлиенте
Процедура ПриемникНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.Приемник = РезультатЗакрытия.Имя;
		Если НЕ Модифицированность Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ПриемникНачалоВыбораЗавершение

&НаКлиенте
Процедура СинхронизироватьПоИдентификаторуПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыАлгоритмыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьТекущийАктивныйОбработчик();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРедакторКода(Команда)
	
	ТекстОбработчика = Элементы[ТекущийАктивныйОбработчик + "Редактор"].Документ.defaultView.editor.getValue();
	мПараметры = Новый Структура("ТекстОбработчика", ТекстОбработчика);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияРедактораКода", ЭтотОбъект);
	ОткрытьФорму("Обработка.СМП_РедакторКода.Форма", мПараметры, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик оповещения.
//
&НаКлиенте
Процедура ПослеЗакрытияРедактораКода(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы[ТекущийАктивныйОбработчик + "Редактор"].Документ.defaultView.editor.setValue(РезультатЗакрытия);
	Если РезультатЗакрытия <> Объект[ТекущийАктивныйОбработчик] Тогда
		Объект[ТекущийАктивныйОбработчик] = РезультатЗакрытия;
		Модифицированность = Истина;
		ОбновитьНаличиеОбработчиковАлгоритмов();
	КонецЕсли;
	
КонецПроцедуры //ПослеЗакрытияРедактораКода

&НаКлиенте
Процедура СформироватьИмяПравила(Команда)
	
	СформироватьИмяПравилаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеПравила(Команда)
	
	Объект.Наименование = СМП_ОбщегоНазначения.глНаименованиеПКО(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьГруппуПравила(Команда)
	
	УстановитьГруппуПравилаНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьГруппуПравилаНаСервере() 
	
	ОбъектПКО = РеквизитФормыВЗначение("Объект");
	СМП_ОбщегоНазначения.УстановитьГруппуПоУмолчаниюДляПКО(объектПКО);
	ЗначениеВРеквизитФормы(ОбъектПКО, "Объект");
	
КонецПроцедуры //УстановитьГруппуПравилаНаСервере

&НаСервере
Процедура СформироватьИмяПравилаНаСервере() 
	
	ОбъектПКО = РеквизитФормыВЗначение("Объект");
	ОбъектПКО.СгенерироватьУникальныйКод();
	ЗначениеВРеквизитФормы(ОбъектПКО, "Объект");
	
КонецПроцедуры //СформироватьИмяПравила

&НаСервере
Процедура ИсточникПриИзмененииНаСервере() 
	
	ОбъектПКО = РеквизитФормыВЗначение("Объект");
	СМП_ОбщегоНазначения.ИсточникПриИзмененииПКО(ОбъектПКО);
	ЗначениеВРеквизитФормы(ОбъектПКО, "Объект");
	
КонецПроцедуры //ИсточникПриИзмененииНаСервере

&НаСервере
Процедура ПриемникПриИзмененииНаСервере()
	
	ОбъектПКО = РеквизитФормыВЗначение("Объект");
	СМП_ОбщегоНазначения.ПриемникПриИзмененииПКО(ОбъектПКО);
	ЗначениеВРеквизитФормы(ОбъектПКО, "Объект");
	
КонецПроцедуры

// .
//
// Параметры:
//   Нет.
//
&НаСервере
Процедура ПриСозданииЧтенииНаСервере() 
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.ЗначенияЗаполнения.Свойство("КонфигурацияИсточник", КонфигурацияИсточник);
		Параметры.ЗначенияЗаполнения.Свойство("КонфигурацияПриемник", КонфигурацияПриемник);
	Иначе
		сДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "Источник, Приемник");
		КонфигурацияИсточник = сДанные.Источник;
		КонфигурацияПриемник = сДанные.Приемник;
	КонецЕсли;
	
	//отСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	отОбъекты = Новый ОписаниеТипов("СправочникСсылка.Объекты");
	Элементы.Источник.ОграничениеТипа = отОбъекты; //?(ЗначениеЗаполнено(КонфигурацияИсточник), отОбъекты, отСтрока);
	Элементы.Приемник.ОграничениеТипа = отОбъекты; //?(ЗначениеЗаполнено(КонфигурацияПриемник), отОбъекты, отСтрока);
	
КонецПроцедуры //ПриСозданииЧтенииНаСервере

// Выполняет установку видимости и доступности элементов формы.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли.Доступность = Объект.СинхронизироватьПоИдентификатору;
	Элементы.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD.Доступность = Объект.СинхронизироватьПоИдентификатору;
	
КонецПроцедуры //УстановитьВидимость

// Редактор кода
&НаКлиенте
Процедура ЗагрузитьРедакторКода(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	ДанныеПолей = Новый Соответствие;
	ДанныеПолей.Вставить("АлгоритмПередВыгрузкойОбъектаРедактор", Объект.АлгоритмПередВыгрузкойОбъекта);
	ДанныеПолей.Вставить("АлгоритмПриВыгрузкеОбъектаРедактор", Объект.АлгоритмПриВыгрузкеОбъекта);
	ДанныеПолей.Вставить("АлгоритмПослеВыгрузкиОбъектаРедактор", Объект.АлгоритмПослеВыгрузкиОбъекта);
	ДанныеПолей.Вставить("АлгоритмПослеВыгрузкиОбъектаВФайлОбменаРедактор", Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена);
	ДанныеПолей.Вставить("АлгоритмПоследовательностьПолейПоискаРедактор", Объект.АлгоритмПоследовательностьПолейПоиска);
	ДанныеПолей.Вставить("АлгоритмПередЗагрузкойОбъектаРедактор", Объект.АлгоритмПередЗагрузкойОбъекта);
	ДанныеПолей.Вставить("АлгоритмПриЗагрузкеОбъектаРедактор", Объект.АлгоритмПриЗагрузкеОбъекта);
	ДанныеПолей.Вставить("АлгоритмПослеЗагрузкиОбъектаРедактор", Объект.АлгоритмПослеЗагрузкиОбъекта);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтотОбъект, ДанныеПолей, ИмяКаталогаВременныхФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаличиеОбработчиковАлгоритмов()

	Картинка = БиблиотекаКартинок.СинтаксическийКонтроль;
	НоваяКартинка = Новый Картинка;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПередВыгрузкойОбъекта)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПриВыгрузкеОбъекта)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПослеВыгрузкиОбъекта)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПоследовательностьПолейПоиска)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПередЗагрузкойОбъекта)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПриЗагрузкеОбъекта)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиОбъекта)
			
		Тогда
		Элементы.СтраницаОбработчикиСобытий.Картинка = Картинка;
	Иначе
		Элементы.СтраницаОбработчикиСобытий.Картинка = НоваяКартинка;
	КонецЕсли;
	
	Элементы.СтраницаАлгоритмПередВыгрузкойОбъекта.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПередВыгрузкойОбъекта), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПриВыгрузкеОбъекта.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПриВыгрузкеОбъекта), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПослеВыгрузкиОбъекта.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПослеВыгрузкиОбъекта), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПослеВыгрузкиОбъектаВФайлОбмена.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПоследовательностьПолейПоиска.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПоследовательностьПолейПоиска), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПередЗагрузкойОбъекта.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПередЗагрузкойОбъекта), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПриЗагрузкеОбъекта.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПриЗагрузкеОбъекта), Картинка, НоваяКартинка);
	Элементы.СтраницаАлгоритмПослеЗагрузкиОбъекта.Картинка = ?(ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиОбъекта), Картинка,НоваяКартинка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийАктивныйОбработчик() 
	
	ИмяТекВкладки = Элементы.СтраницыАлгоритмы.ТекущаяСтраница.Имя;
	ТекущийАктивныйОбработчик = СтрЗаменить(ИмяТекВкладки, "Страница", "");
	
КонецПроцедуры //ОбновитьТекущийАктивныйОбработчик

#КонецОбласти
